proxy/ws_calls/Test/BASE/DateReplace1ITCase/ShoppingApi_shop__SABREGDS_SSWIntellisell_ToSend_1_RQ.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><ns5:MessageHeader xmlns:ns14="http://www.sabre.com/ns/Ticketing/misc/1.0" xmlns:ns13="http://webservices.sabre.com/sabreXML/2003/07/request" xmlns:ns12="http://www.opentravel.org/OTA/2002/11" xmlns:ns11="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:ns10="http://services.sabre.com/STL/v01" xmlns:ns9="http://webservices.sabre.com/sabreXML/2003/07/response" xmlns:ns8="http://webservices.sabre.com/sabreXML/2003/07" xmlns:ns7="http://www.w3.org/2000/09/xmldsig#" xmlns:ns6="http://www.w3.org/1999/xlink" xmlns:ns5="http://www.ebxml.org/namespaces/messageHeader" xmlns:ns4="http://www.opentravel.org/OTA/2003/05"><ns5:From><ns5:PartyId>99999</ns5:PartyId></ns5:From><ns5:To><ns5:PartyId>123123</ns5:PartyId></ns5:To><ns5:CPAId>B6</ns5:CPAId><ns5:ConversationId>testConversationId</ns5:ConversationId><ns5:Service ns5:type="OTA">Air Shopping Service</ns5:Service><ns5:Action>SSWIntellisellRQ</ns5:Action><ns5:MessageData><ns5:MessageId>mid:2011-11-25T05:39:21@eb2.com</ns5:MessageId><ns5:Timestamp>2011-11-25T05:39:21</ns5:Timestamp></ns5:MessageData></ns5:MessageHeader><ns11:Security xmlns:ns14="http://www.sabre.com/ns/Ticketing/misc/1.0" xmlns:ns13="http://webservices.sabre.com/sabreXML/2003/07/request" xmlns:ns12="http://www.opentravel.org/OTA/2002/11" xmlns:ns11="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:ns10="http://services.sabre.com/STL/v01" xmlns:ns9="http://webservices.sabre.com/sabreXML/2003/07/response" xmlns:ns8="http://webservices.sabre.com/sabreXML/2003/07" xmlns:ns7="http://www.w3.org/2000/09/xmldsig#" xmlns:ns6="http://www.w3.org/1999/xlink" xmlns:ns5="http://www.ebxml.org/namespaces/messageHeader" xmlns:ns4="http://www.opentravel.org/OTA/2003/05"><ns11:BinarySecurityToken>Shared/IDL:IceSess\/SessMgr:1\.0.IDL/Common/!ICESMS\/ACPCRTD!ICESMSLB\/CRT.LB!-3982912003847665536!908171!0</ns11:BinarySecurityToken></ns11:Security></soap:Header><soap:Body><ns4:OTA_AirLowFareSearchRQ xmlns:ns14="http://www.sabre.com/ns/Ticketing/misc/1.0" xmlns:ns13="http://webservices.sabre.com/sabreXML/2003/07/request" xmlns:ns12="http://www.opentravel.org/OTA/2002/11" xmlns:ns11="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:ns10="http://services.sabre.com/STL/v01" xmlns:ns9="http://webservices.sabre.com/sabreXML/2003/07/response" xmlns:ns8="http://webservices.sabre.com/sabreXML/2003/07" xmlns:ns7="http://www.w3.org/2000/09/xmldsig#" xmlns:ns6="http://www.w3.org/1999/xlink" xmlns:ns5="http://www.ebxml.org/namespaces/messageHeader" xmlns:ns4="http://www.opentravel.org/OTA/2003/05" DirectFlightsOnly="false" AvailableFlightsOnly="true" Target="Production" Version="1.4.6" MaxResponses="0"><ns4:POS><ns4:Source PseudoCityCode="NIH"><ns4:RequestorID Type="1" ID="1"><ns4:CompanyName Code="SSW">SSW</ns4:CompanyName></ns4:RequestorID></ns4:Source></ns4:POS><ns4:OriginDestinationInformation RPH="1"><ns4:DepartureDateTime>2012-01-27T00:00:00</ns4:DepartureDateTime><ns4:OriginLocation LocationCode="JFK"/><ns4:DestinationLocation LocationCode="LAX"/><ns4:TPA_Extensions><ns4:DateFlexibility NbrOfDays="3"/><ns4:SegmentType Code="O"/><ns4:NumOneWayOptions Number="20"/></ns4:TPA_Extensions></ns4:OriginDestinationInformation><ns4:OriginDestinationInformation RPH="2"><ns4:DepartureDateTime>2012-01-29T00:00:00</ns4:DepartureDateTime><ns4:OriginLocation LocationCode="LAX"/><ns4:DestinationLocation LocationCode="JFK"/><ns4:TPA_Extensions><ns4:DateFlexibility NbrOfDays="3"/><ns4:SegmentType Code="O"/><ns4:NumOneWayOptions Number="20"/></ns4:TPA_Extensions></ns4:OriginDestinationInformation><ns4:TravelPreferences><ns4:VendorPref Code="B6"/></ns4:TravelPreferences><ns4:TravelerInfoSummary><ns4:SeatsRequested>1</ns4:SeatsRequested><ns4:AirTravelerAvail><ns4:PassengerTypeQuantity Code="ADT" Quantity="1"/></ns4:AirTravelerAvail><ns4:PriceRequestInformation FareQualifier="false" Reprice="false"><ns4:TPA_Extensions><ns4:Indicators><ns4:RetainFare Ind="false"/><ns4:MinMaxStay Ind="false"/><ns4:RefundPenalty Ind="true"/><ns4:ResTicketing Ind="true"/><ns4:TravelPolicy Ind="false"/></ns4:Indicators></ns4:TPA_Extensions></ns4:PriceRequestInformation></ns4:TravelerInfoSummary><ns4:TPA_Extensions><ns4:IntelliSellTransaction><ns4:RequestType Name="CALDATES"/><ns4:ServiceTag Name="B6"/></ns4:IntelliSellTransaction></ns4:TPA_Extensions></ns4:OTA_AirLowFareSearchRQ></soap:Body></soap:Envelope>